app/views/registrations/index.html.erb

<ul>
    <% @course.registrations.each do |c| %>
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."course_id" = ?  [["course_id", "6"]]