app/views/wizards/show.html.erb


<% @wizard.courses.each do |course| %>
---
SELECT "courses".* FROM "courses" INNER JOIN "registrations" ON "courses"."id" = "registrations"."course_id" WHERE "registrations"."wizard_id" = ?  [["wizard_id", "1"]]