app/controllers/application_controller.rb

    def current_wizard
        if session[:wizard_id].present?
            wizard = Wizard.find_by(:id => session[:wizard_id])
---
SELECT "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]