app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "description", "location", "maximum_participants", "created_at", "updated_at", "course_time") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)
		@course.save

UPDATE "courses" SET "maximum_participants" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["maximum_participants", 12], ["updated_at", "2020-04-13 01:22:49.541433"], ["id", 1]]
---
  def update
	  @course.update(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_course
    @course = Course.find(params[:id])