app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("wizard_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wizard_id", "1"], ["course_id", "1"], ["created_at", "2020-04-11 18:23:28.144031"], ["updated_at", "2020-04-11 18:23:28.144031"]]
---
    def create
        registration = Registration.create(wizard_id: current_wizard.id, course_id: params[:course_id])