app/controllers/registrations_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "registrations".* FROM "registrations" WHERE "registrations"."course_id" = ?  [["course_id", "6"]]
SELECT "courses".* FROM "courses" WHERE (7) LIMIT ?  [["LIMIT", 1]]
SELECT "courses".* FROM "courses"
---
    def index
        @course = Course.find(params[:course_id])
        if params[:course_id]
            @registrations = Course.find_by(params[:course_id]).registrations
        else
            @registrations = Registration.all

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def new
        course = Course.find(params[:course_id])

INSERT INTO "registrations" ("wizard_id", "course_id", "time_slot", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["wizard_id", "1"], ["course_id", "5"], ["time_slot", "Saturday PM"], ["created_at", "2020-04-16 02:50:56.878537"], ["updated_at", "2020-04-16 02:50:56.878537"]]
---
    def create
        # if Registration.not_more_than_three
            # registration = Registration.create(registration_params)
        registration = current_wizard.registrations.build(registration_params)

        if registration.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def edit
        @course = Course.find_by_id(params[:course_id])

UPDATE "registrations" SET "time_slot" = ?, "updated_at" = ? WHERE "registrations"."id" = ?  [["time_slot", "Saturday PM"], ["updated_at", "2020-04-16 02:54:01.216301"], ["id", 7]]
---
    def update
        @registration.update(registration_params)

SELECT "registrations".* FROM "registrations" WHERE "registrations"."wizard_id" = ? AND "registrations"."id" = ? LIMIT ?  [["wizard_id", "1"], ["id", 5], ["LIMIT", 1]]
DELETE FROM "registrations" WHERE "registrations"."id" = ?  [["id", 5]]
---
    def destroy
        # @registration = current_wizard.registrations.find_by_id(params[:id])
        @registration = current_wizard.registrations.find_by_id(params[:id])
            if @registration
                @registration.destroy

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_registration
        @registration = Registration.find_by_id(params[:id])