app/controllers/registrations_controller.rb

SELECT "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def index
        @wizard = Wizard.find(params[:wizard_id])

SELECT "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @wizard = Wizard.find_by_id(params[:wizard_id])