app/controllers/sessions_controller.rb

SELECT "wizards".* FROM "wizards" WHERE "wizards"."email" = ? LIMIT ?  [["email", "dkelley@gmail.com"], ["LIMIT", 1]]
---
  def create
    @wizard = Wizard.find_by(email: params[:email])

SELECT "wizards".* FROM "wizards" WHERE "wizards"."uid" = ? LIMIT ?  [["uid", "833649942270"], ["LIMIT", 1]]
---
  def facebook
    @wizard = Wizard.find_or_create_by(UID: auth['UID']) do |w|