app/controllers/wizards_controller.rb

  def show
    @wizard = Wizard.find_by(:id => params[:id])
---
SELECT "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]