app/controllers/wizards_controller.rb

  def index
    if params[:house] = "Gryffindor"
      @wizards = Wizard.griffindor
    elsif params[:house] = "Slytherin"
      @wizards = Wizard.slytherin
    elsif params[:house] = "Ravenclaw"
      @wizards = Wizard.ravenclaw
    elsif params[:house] = "Hufflepuff"
      @wizards = Wizard.hufflepuff
    else
      @wizards = Wizard.all
---
SELECT "wizards".* FROM "wizards"

  def create
    @wizard = Wizard.create(wizard_params)
---
INSERT INTO "wizards" ("email", "password_digest", "first_name", "last_name", "house", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def find_wizard
    @wizard = Wizard.find(params[:id])
---
SELECT "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]