app/controllers/wizards_controller.rb

  def find_wizard
    @wizard = Wizard.find(params[:id])
---
SELECT "wizards".* FROM "wizards" WHERE "wizards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]