app/models/course.rb

    def currently_enrolled
        self.wizards.size
---
SELECT COUNT(*) FROM "wizards" INNER JOIN "registrations" ON "wizards"."id" = "registrations"."wizard_id" WHERE "registrations"."course_id" = ?  [["course_id", "5"]]